let db = [
  //公司对象
  {
    name: '1号公司',
    children: [
      //子公司对象
      {
        name: '1-1子公司',
        children: [
          //子公司旗下每个矿对象
          {
            name: '1-1-1矿',
            //子公司旗下每个矿旗下每个工作面对象
            children: [{
                name: '1-1-1-1工作面'
              },
              {
                name: '1-1-1-2工作面'
              },
              {
                name: '1-1-1-3工作面'
              },
              {
                name: '1-1-1-4工作面'
              },
              {
                name: '1-1-1-5工作面'
              },
              {
                name: '1-1-1-6工作面'
              }
            ]
          },
          {
            name: '1-1-2矿',
            children: [{
                name: '1-1-2-1工作面'
              },
              {
                name: '1-1-2-2工作面'
              },
              {
                name: '1-1-2-3工作面'
              },
              {
                name: '1-1-2-4工作面'
              },
              {
                name: '1-1-2-5工作面'
              },
              {
                name: '1-1-2-6工作面'
              }
            ]
          },
          {
            name: '1-1-3矿',
            children: [{
                name: '1-1-3-1工作面'
              },
              {
                name: '1-1-3-2工作面'
              },
              {
                name: '1-1-3-3工作面'
              },
              {
                name: '1-1-3-4工作面'
              },
              {
                name: '1-1-3-5工作面'
              },
              {
                name: '1-1-3-6工作面'
              }
            ]
          }
        ]
      },
      {
        name: '1-2子公司',
        children: [{
            name: '1-2-1矿',
            children: [{
                name: '1-2-1-1工作面'
              },
              {
                name: '1-2-1-2工作面'
              },
              {
                name: '1-2-1-3工作面'
              },
              {
                name: '1-2-1-4工作面'
              },
              {
                name: '1-2-1-5工作面'
              },
              {
                name: '1-2-1-6工作面'
              }
            ]
          },
          {
            name: '1-2-2矿',
            children: [{
                name: '1-2-2-1工作面'
              },
              {
                name: '1-2-2-2工作面'
              },
              {
                name: '1-2-2-3工作面'
              },
              {
                name: '1-2-2-4工作面'
              },
              {
                name: '1-2-2-5工作面'
              },
              {
                name: '1-2-2-6工作面'
              }
            ]
          },
          {
            name: '1-2-3矿',
            children: [{
                name: '1-2-3-1工作面'
              },
              {
                name: '1-2-3-2工作面'
              },
              {
                name: '1-2-3-3工作面'
              },
              {
                name: '1-2-3-4工作面'
              },
              {
                name: '1-2-3-5工作面'
              },
              {
                name: '1-2-3-6工作面'
              }
            ]
          }
        ]
      }
    ]
  },
  //公司对象
  {
    name: '2号公司',
    children: [
      //子公司对象
      {
        name: '2-1子公司',
        children: [
          //子公司旗下每个矿对象
          {
            name: '2-1-1矿',
            //子公司旗下每个矿旗下每个工作面对象
            children: [{
                name: '2-1-1-1工作面'
              },
              {
                name: '2-1-1-2工作面'
              },
              {
                name: '2-1-1-3工作面'
              },
              {
                name: '2-1-1-4工作面'
              },
              {
                name: '2-1-1-5工作面'
              },
              {
                name: '2-1-1-6工作面'
              }
            ]
          },
          {
            name: '2-1-2矿',
            children: [{
                name: '2-1-2-1工作面'
              },
              {
                name: '2-1-2-2工作面'
              },
              {
                name: '2-1-2-3工作面'
              },
              {
                name: '2-1-2-4工作面'
              },
              {
                name: '2-1-2-5工作面'
              },
              {
                name: '2-1-2-6工作面'
              }
            ]
          },
          {
            name: '2-1-3矿',
            children: [{
                name: '2-1-3-1工作面'
              },
              {
                name: '2-1-3-2工作面'
              },
              {
                name: '2-1-3-3工作面'
              },
              {
                name: '2-1-3-4工作面'
              },
              {
                name: '2-1-3-5工作面'
              },
              {
                name: '2-1-3-6工作面'
              }
            ]
          }
        ]
      },
      {
        name: '2-2子公司',
        children: [{
            name: '2-2-1矿',
            children: [{
                name: '2-2-1-1工作面'
              },
              {
                name: '2-2-1-2工作面'
              },
              {
                name: '2-2-1-3工作面'
              },
              {
                name: '2-2-1-4工作面'
              },
              {
                name: '2-2-1-5工作面'
              },
              {
                name: '2-2-1-6工作面'
              }
            ]
          },
          {
            name: '2-2-2矿',
            children: [{
                name: '2-2-2-1工作面'
              },
              {
                name: '2-2-2-2工作面'
              },
              {
                name: '2-2-2-3工作面'
              },
              {
                name: '2-2-2-4工作面'
              },
              {
                name: '2-2-2-5工作面'
              },
              {
                name: '2-2-2-6工作面'
              }
            ]
          },
          {
            name: '2-2-3矿',
            children: [{
                name: '2-2-3-1工作面'
              },
              {
                name: '2-2-3-2工作面'
              },
              {
                name: '2-2-3-3工作面'
              },
              {
                name: '2-2-3-4工作面'
              },
              {
                name: '2-2-3-5工作面'
              },
              {
                name: '2-2-3-6工作面'
              }
            ]
          }
        ]
      }
    ]
  },
  //公司对象
  {
    name: '3号公司',
    children: [
      //子公司对象
      {
        name: '3-1子公司',
        children: [
          //子公司旗下每个矿对象
          {
            name: '3-1-1矿',
            //子公司旗下每个矿旗下每个工作面对象
            children: [{
                name: '3-1-1-1工作面'
              },
              {
                name: '3-1-1-2工作面'
              },
              {
                name: '3-1-1-3工作面'
              },
              {
                name: '3-1-1-4工作面'
              },
              {
                name: '3-1-1-5工作面'
              },
              {
                name: '3-1-1-6工作面'
              }
            ]
          },
          {
            name: '3-1-2矿',
            children: [{
                name: '3-1-2-1工作面'
              },
              {
                name: '3-1-2-2工作面'
              },
              {
                name: '3-1-2-3工作面'
              },
              {
                name: '3-1-2-4工作面'
              },
              {
                name: '3-1-2-5工作面'
              },
              {
                name: '3-1-2-6工作面'
              }
            ]
          },
          {
            name: '3-1-3矿',
            children: [{
                name: '3-1-3-1工作面'
              },
              {
                name: '3-1-3-2工作面'
              },
              {
                name: '3-1-3-3工作面'
              },
              {
                name: '3-1-3-4工作面'
              },
              {
                name: '3-1-3-5工作面'
              },
              {
                name: '3-1-3-6工作面'
              }
            ]
          }
        ]
      },
      {
        name: '3-2子公司',
        children: [{
            name: '3-2-1矿',
            children: [{
                name: '3-2-1-1工作面'
              },
              {
                name: '3-2-1-2工作面'
              },
              {
                name: '3-2-1-3工作面'
              },
              {
                name: '3-2-1-4工作面'
              },
              {
                name: '3-2-1-5工作面'
              },
              {
                name: '3-2-1-6工作面'
              }
            ]
          },
          {
            name: '3-2-2矿',
            children: [{
                name: '3-2-2-1工作面'
              },
              {
                name: '3-2-2-2工作面'
              },
              {
                name: '3-2-2-3工作面'
              },
              {
                name: '3-2-2-4工作面'
              },
              {
                name: '3-2-2-5工作面'
              },
              {
                name: '3-2-2-6工作面'
              }
            ]
          },
          {
            name: '3-2-3矿',
            children: [{
                name: '3-2-3-1工作面'
              },
              {
                name: '3-2-3-2工作面'
              },
              {
                name: '3-2-3-3工作面'
              },
              {
                name: '3-2-3-4工作面'
              },
              {
                name: '3-2-3-5工作面'
              },
              {
                name: '3-2-3-6工作面'
              }
            ]
          }
        ]
      }
    ]
  }
]